{
  "categories": {
    "express_entry": {
      "id": "express-entry",
      "title": "Express Entry",
      "description": "Canada's fastest pathway to permanent residence for skilled workers. Learn about CRS scoring, draw patterns, and application strategies.",
      "icon": "bi-lightning-charge",
      "color": "#22C55E",
      "guides": [
        {
          "id": "overview",
          "title": "Express Entry Complete Guide",
          "subtitle": "Everything you need to know about Canada's flagship immigration system",
          "icon": "🚀",
          "difficulty": "Beginner",
          "reading_time": "15 min read",
          "overview": "Express Entry is Canada's premier immigration system for skilled workers, managing applications for three federal economic immigration programs. Since 2015, it has become the fastest pathway to Canadian permanent residence, with processing times of 6 months or less.",
          "sections": [
            {
              "title": "What is Express Entry?",
              "content": "Express Entry is an online system that manages applications for permanent residence under three federal economic immigration programs: Federal Skilled Worker (FSW), Federal Skilled Trades (FST), and Canadian Experience Class (CEC). Candidates create profiles, receive Comprehensive Ranking System (CRS) scores, and are ranked against each other in the Express Entry pool."
            },
            {
              "title": "How It Works",
              "content": "1. Check your eligibility for one or more Express Entry programs\n2. Gather required documents (ECA, language tests, work experience letters)\n3. Create your Express Entry profile\n4. Receive your CRS score and enter the pool\n5. Receive an Invitation to Apply (ITA) if your score is above the cutoff\n6. Submit your complete application within 60 days\n7. Receive your PR decision (typically within 6 months)"
            },
            {
              "title": "CRS Score Factors",
              "content": "Your CRS score is calculated based on: Age (max 110 points), Education (max 150 points), Language proficiency (max 160 points), Canadian work experience (max 80 points), Spouse factors (if applicable), Transferability factors, and Additional points for provincial nomination (+600), job offer (+50-200), Canadian education (+15-30), or French proficiency (+25-50)."
            }
          ]
        },
        {
          "id": "crs-scoring",
          "title": "CRS Scoring Deep Dive",
          "subtitle": "Understand exactly how your CRS score is calculated",
          "icon": "📊",
          "difficulty": "Intermediate",
          "reading_time": "12 min read",
          "overview": "The Comprehensive Ranking System (CRS) is the points-based system used to rank Express Entry candidates. Understanding how each factor contributes to your score is essential for maximizing your chances of receiving an ITA.",
          "sections": [
            {
              "title": "CRS Score Components",
              "content": "Your CRS score (maximum 1,200 points) consists of four main components: Core/Human Capital Factors (up to 500 points for single applicants, 460 for those with a spouse), Spouse Factors (up to 40 points), Skill Transferability Factors (up to 100 points), and Additional Points (up to 600 points for provincial nomination)."
            },
            {
              "title": "Age Points",
              "content": "Age is worth up to 110 points (single) or 100 points (with spouse). Peak points are awarded between ages 20-29. Points decrease gradually: Age 30 = 105 points, Age 35 = 77 points, Age 40 = 50 points, Age 45+ = 0 points. This makes age one of the few factors you cannot directly improve."
            },
            {
              "title": "Education Points",
              "content": "Education is worth up to 150 points (single) or 140 points (with spouse). Points by credential: Secondary diploma (30 points), One-year post-secondary (90 points), Two-year program (98 points), Bachelor's degree or 3+ year program (120 points), Two or more credentials with one 3+ years (128 points), Master's degree (135 points), Doctoral degree (150 points)."
            },
            {
              "title": "Language Proficiency Points",
              "content": "First official language is worth up to 136 points (single) or 128 points (with spouse). Points per ability at each CLB level: CLB 4-5 = 6 points, CLB 6 = 9 points, CLB 7 = 17 points, CLB 8 = 23 points, CLB 9 = 31 points, CLB 10+ = 34 points. Second official language adds up to 24 points with CLB 5+ in all abilities."
            },
            {
              "title": "Canadian Work Experience Points",
              "content": "Canadian work experience (NOC TEER 0, 1, 2, or 3) is worth up to 80 points (single) or 70 points (with spouse). Points breakdown: 1 year = 40 points, 2 years = 53 points, 3 years = 64 points, 4 years = 72 points, 5+ years = 80 points. Must be skilled work in Canada within the last 10 years."
            },
            {
              "title": "Skill Transferability Factors",
              "content": "Worth up to 100 points total (max 50 per combination). These combine your education, work experience, and language skills: Education + Language (CLB 7+ with post-secondary = 25-50 points), Education + Canadian Work (13-50 points), Foreign Work + Language (13-50 points), Foreign Work + Canadian Work (13-50 points), Trade Certificate + Language (25-50 points)."
            },
            {
              "title": "Additional Points",
              "content": "Provincial Nomination: 600 points (guarantees ITA). French proficiency: 25 points (CLB 7+ French with CLB 4 English) or 50 points (CLB 7+ in both). Canadian education: 15 points (1-2 year credential) or 30 points (3+ years). Sibling in Canada (citizen/PR): 15 points. Note: Job offer points were removed as of March 2025."
            }
          ]
        },
        {
          "id": "improve-score",
          "title": "How to Improve Your CRS Score",
          "subtitle": "Proven strategies to boost your score and get an ITA faster",
          "icon": "📈",
          "difficulty": "Intermediate",
          "reading_time": "10 min read",
          "overview": "If your CRS score is below recent draw cutoffs, there are several proven strategies to improve your ranking. From retaking language tests to gaining Canadian experience, learn the most effective ways to increase your score.",
          "sections": [
            {
              "title": "Improve Your Language Scores",
              "content": "Language proficiency offers the highest point potential. Retake your English test (IELTS, CELPIP, PTE Core) aiming for CLB 9+ in all abilities. Each CLB level above 7 adds significant points: CLB 8 vs CLB 7 is +24 points (6 per ability). CLB 9 vs CLB 8 is +32 points. CLB 10 vs CLB 9 is +12 points. Focus on your weakest ability first."
            },
            {
              "title": "Learn French",
              "content": "French proficiency provides major bonus points: 25 points for CLB 7+ French with CLB 4 English, or 50 points for CLB 7+ in both French AND CLB 5+ English. TEF Canada and TCF Canada are the accepted French tests. Even intermediate French (NCLC 5-6) helps you qualify for French category-based draws with lower cutoffs (often 400-435)."
            },
            {
              "title": "Get a Provincial Nomination",
              "content": "A provincial nomination (PNP) adds 600 CRS points - the single most valuable boost. This virtually guarantees an ITA. Research PNP streams you qualify for: Ontario's Human Capital Priorities, BC PNP Tech, Alberta Express Entry, Saskatchewan SINP. Many provinces don't require job offers for Express Entry-linked streams."
            },
            {
              "title": "Gain Canadian Experience",
              "content": "One year of Canadian work experience (NOC TEER 0, 1, 2, or 3) adds 40 points for singles, plus skill transferability bonuses. Options include: working on a PGWP after Canadian studies, getting an employer-specific work permit (LMIA), or working under IEC (Working Holiday). Canadian experience also qualifies you for Canadian Experience Class (CEC) draws."
            },
            {
              "title": "Complete Canadian Education",
              "content": "A Canadian credential adds 15-30 points: 15 points for a 1-2 year program, 30 points for 3+ years. It also provides skill transferability points when combined with strong language scores. Consider a 1-year college diploma or graduate certificate in a field related to your occupation. Bonus: This leads to a PGWP for Canadian experience."
            },
            {
              "title": "Leverage Category-Based Draws",
              "content": "Since 2023, IRCC conducts targeted draws with lower cutoffs: Healthcare (nurses, doctors, allied health), STEM occupations, Trades (electricians, plumbers, carpenters), French language proficiency, Transport, Agriculture. Check if your NOC code qualifies. French and trades draws have had cutoffs as low as 388-435 vs 500+ for general draws."
            }
          ]
        },
        {
          "id": "category-draws",
          "title": "Category-Based Draws Explained",
          "subtitle": "Healthcare, STEM, French, and Trade occupation draws",
          "icon": "🎯",
          "difficulty": "Intermediate",
          "reading_time": "8 min read",
          "overview": "Since 2023, IRCC has been conducting category-based draws targeting specific occupations and skills. These draws often have significantly lower CRS cutoffs than general draws, making them an excellent opportunity for eligible candidates.",
          "sections": [
            {
              "title": "What Are Category-Based Draws?",
              "content": "Category-based draws are targeted Express Entry rounds that invite candidates based on specific attributes rather than just CRS score. Introduced in 2023, these draws allow IRCC to select candidates who fill labor market gaps in key sectors. Categories include: Healthcare, STEM, Trades, Transport, Agriculture, and French language proficiency."
            },
            {
              "title": "Healthcare Category",
              "content": "Healthcare draws target medical professionals. Eligible NOC codes include: 31102 (Family physicians), 31301 (Registered nurses), 31302 (Nurse practitioners), 32101 (Licensed practical nurses), 32120 (Medical laboratory technologists), and many allied health professions. Cutoffs have ranged from 420-480. Must have valid ECA for foreign credentials."
            },
            {
              "title": "STEM Category",
              "content": "STEM (Science, Technology, Engineering, Math) draws target tech workers and engineers. Key NOC codes: 21211 (Data scientists), 21231 (Software engineers), 21232 (Software developers), 21300-21399 (Engineers), 21220 (Cybersecurity specialists). Cutoffs typically 480-520. Valid work experience in STEM field required within last 3 years."
            },
            {
              "title": "Trades Category",
              "content": "Trade occupation draws have had some of the lowest cutoffs (388-436). Eligible NOCs include: 72310 (Carpenters), 72400 (Electricians), 72410 (Plumbers), 73200 (Residential installers), 73400 (Heavy equipment operators). Must have 6 months continuous full-time work experience in the trade within last 3 years."
            },
            {
              "title": "French Language Category",
              "content": "French proficiency draws have seen the most invitations and lowest cutoffs (379-435). To qualify you need: NCLC 7+ in all four French abilities (speaking, listening, reading, writing). No specific occupation required. French test results (TEF Canada or TCF Canada) must be valid. This is often the easiest category to qualify for."
            },
            {
              "title": "How to Check Your Eligibility",
              "content": "1. Find your NOC code using the NOC Finder tool. 2. Check if your NOC is in the eligible list for any category. 3. Ensure you have qualifying work experience (usually 6 months to 1 year in last 3 years). 4. For French: take TEF or TCF and achieve NCLC 7+. 5. Update your Express Entry profile to reflect qualifying factors. 6. Monitor draw announcements on the IRCC website."
            }
          ]
        }
      ]
    },
    "provincial_programs": {
      "id": "pnp",
      "title": "Provincial Nominee Programs",
      "description": "Explore immigration streams from all 13 Canadian provinces and territories. A provincial nomination adds 600 CRS points to your Express Entry score.",
      "icon": "bi-geo-alt",
      "color": "#6366F1",
      "provinces": [
        {
          "id": "ontario",
          "name": "Ontario",
          "code": "ON",
          "program_name": "Ontario Immigrant Nominee Program (OINP)",
          "capital": "Toronto",
          "population": "15.8 million",
          "description": "Canada's largest province with a diverse economy and the most Express Entry-aligned PNP streams.",
          "streams": [
            {
              "name": "Human Capital Priorities",
              "type": "Express Entry",
              "description": "For candidates with Express Entry profiles in in-demand occupations"
            },
            {
              "name": "Skilled Trades",
              "type": "Express Entry",
              "description": "For skilled tradespeople with Ontario job offers or work experience"
            },
            {
              "name": "French-Speaking Skilled Worker",
              "type": "Express Entry",
              "description": "For French-speaking candidates with strong English proficiency"
            },
            {
              "name": "Tech Draw",
              "type": "Express Entry",
              "description": "Periodic draws targeting tech occupations"
            },
            {
              "name": "Employer Job Offer",
              "type": "Non-Express Entry",
              "description": "For candidates with valid job offers from Ontario employers"
            },
            {
              "name": "Masters Graduate",
              "type": "Non-Express Entry",
              "description": "For graduates of Ontario master's programs"
            },
            {
              "name": "PhD Graduate",
              "type": "Non-Express Entry",
              "description": "For graduates of Ontario PhD programs"
            }
          ]
        },
        {
          "id": "british-columbia",
          "name": "British Columbia",
          "code": "BC",
          "program_name": "BC Provincial Nominee Program (BC PNP)",
          "capital": "Victoria",
          "population": "5.4 million",
          "description": "Home to Canada's tech hub in Vancouver with dedicated streams for tech workers.",
          "streams": [
            {
              "name": "BC PNP Tech",
              "type": "Express Entry",
              "description": "Priority processing for 29 in-demand tech occupations"
            },
            {
              "name": "Skilled Worker",
              "type": "Express Entry/Direct",
              "description": "For skilled workers with BC job offers"
            },
            {
              "name": "Healthcare Professional",
              "type": "Direct",
              "description": "For doctors, nurses, and allied health professionals"
            },
            {
              "name": "International Graduate",
              "type": "Express Entry/Direct",
              "description": "For recent graduates from Canadian post-secondary institutions"
            },
            {
              "name": "Entry Level and Semi-Skilled",
              "type": "Direct",
              "description": "For workers in tourism, hospitality, and food processing in specific regions"
            }
          ]
        },
        {
          "id": "alberta",
          "name": "Alberta",
          "code": "AB",
          "program_name": "Alberta Advantage Immigration Program (AAIP)",
          "capital": "Edmonton",
          "population": "4.6 million",
          "description": "Strong economy driven by energy, agriculture, and a growing tech sector.",
          "streams": [
            {
              "name": "Alberta Express Entry",
              "type": "Express Entry",
              "description": "For Express Entry candidates with ties to Alberta"
            },
            {
              "name": "Alberta Opportunity Stream",
              "type": "Non-Express Entry",
              "description": "For foreign workers already employed in Alberta"
            },
            {
              "name": "Rural Renewal Stream",
              "type": "Non-Express Entry",
              "description": "For workers in rural Alberta communities"
            },
            {
              "name": "Tourism and Hospitality Stream",
              "type": "Non-Express Entry",
              "description": "For workers in Alberta's tourism sector"
            }
          ]
        },
        {
          "id": "saskatchewan",
          "name": "Saskatchewan",
          "code": "SK",
          "program_name": "Saskatchewan Immigrant Nominee Program (SINP)",
          "capital": "Regina",
          "population": "1.2 million",
          "description": "Agriculture and resource-based economy with strong demand for skilled workers.",
          "streams": [
            {
              "name": "International Skilled Worker",
              "type": "Express Entry/Direct",
              "description": "For skilled workers with occupation on in-demand list"
            },
            {
              "name": "Saskatchewan Experience",
              "type": "Non-Express Entry",
              "description": "For foreign workers with Saskatchewan work experience"
            },
            {
              "name": "Entrepreneur",
              "type": "Business",
              "description": "For entrepreneurs wanting to start or buy a business in SK"
            }
          ]
        },
        {
          "id": "manitoba",
          "name": "Manitoba",
          "code": "MB",
          "program_name": "Manitoba Provincial Nominee Program (MPNP)",
          "capital": "Winnipeg",
          "population": "1.4 million",
          "description": "Diverse economy with strong settlement support and community connections.",
          "streams": [
            {
              "name": "Skilled Worker in Manitoba",
              "type": "Non-Express Entry",
              "description": "For workers with ongoing employment in Manitoba"
            },
            {
              "name": "Skilled Worker Overseas",
              "type": "Non-Express Entry",
              "description": "For overseas workers with strong Manitoba connections"
            },
            {
              "name": "International Education Stream",
              "type": "Non-Express Entry",
              "description": "For graduates of Manitoba post-secondary institutions"
            }
          ]
        },
        {
          "id": "nova-scotia",
          "name": "Nova Scotia",
          "code": "NS",
          "program_name": "Nova Scotia Nominee Program (NSNP)",
          "capital": "Halifax",
          "population": "1.0 million",
          "description": "Atlantic province with growing tech and healthcare sectors.",
          "streams": [
            {
              "name": "Labour Market Priorities",
              "type": "Express Entry",
              "description": "For Express Entry candidates with in-demand skills"
            },
            {
              "name": "Skilled Worker",
              "type": "Non-Express Entry",
              "description": "For workers with Nova Scotia job offers"
            },
            {
              "name": "Physician Stream",
              "type": "Non-Express Entry",
              "description": "For doctors with job offers from NS health authorities"
            }
          ]
        },
        {
          "id": "new-brunswick",
          "name": "New Brunswick",
          "code": "NB",
          "program_name": "New Brunswick Provincial Nominee Program (NBPNP)",
          "capital": "Fredericton",
          "population": "820,000",
          "description": "Bilingual Atlantic province with growing immigration targets.",
          "streams": [
            {
              "name": "Express Entry Labour Market",
              "type": "Express Entry",
              "description": "For Express Entry candidates with NB job offers or work experience"
            },
            {
              "name": "Skilled Worker with Employer Support",
              "type": "Non-Express Entry",
              "description": "For workers with NB job offers"
            },
            {
              "name": "Post-Graduate Entrepreneurial",
              "type": "Non-Express Entry",
              "description": "For NB graduates wanting to start businesses"
            }
          ]
        },
        {
          "id": "prince-edward-island",
          "name": "Prince Edward Island",
          "code": "PE",
          "program_name": "PEI Provincial Nominee Program (PEI PNP)",
          "capital": "Charlottetown",
          "population": "170,000",
          "description": "Canada's smallest province with welcoming communities.",
          "streams": [
            {
              "name": "Labour Impact",
              "type": "Non-Express Entry",
              "description": "For skilled workers and critical workers with PEI job offers"
            },
            {
              "name": "Express Entry",
              "type": "Express Entry",
              "description": "For Express Entry candidates with PEI job offers"
            }
          ]
        },
        {
          "id": "newfoundland",
          "name": "Newfoundland and Labrador",
          "code": "NL",
          "program_name": "Newfoundland and Labrador PNP (NLPNP)",
          "capital": "St. John's",
          "population": "540,000",
          "description": "Atlantic province with resource-based economy and growing tech sector.",
          "streams": [
            {
              "name": "Express Entry Skilled Worker",
              "type": "Express Entry",
              "description": "For Express Entry candidates with NL job offers"
            },
            {
              "name": "Skilled Worker",
              "type": "Non-Express Entry",
              "description": "For skilled workers with NL job offers"
            },
            {
              "name": "International Graduate",
              "type": "Non-Express Entry",
              "description": "For graduates from NL post-secondary institutions"
            }
          ]
        },
        {
          "id": "yukon",
          "name": "Yukon",
          "code": "YT",
          "program_name": "Yukon Nominee Program (YNP)",
          "capital": "Whitehorse",
          "population": "45,000",
          "description": "Northern territory with unique lifestyle and strong demand for workers.",
          "streams": [
            {
              "name": "Skilled Worker",
              "type": "Non-Express Entry",
              "description": "For skilled workers with Yukon job offers"
            },
            {
              "name": "Critical Impact Worker",
              "type": "Non-Express Entry",
              "description": "For essential workers in critical sectors"
            },
            {
              "name": "Express Entry",
              "type": "Express Entry",
              "description": "For Express Entry candidates with Yukon connections"
            }
          ]
        },
        {
          "id": "northwest-territories",
          "name": "Northwest Territories",
          "code": "NT",
          "program_name": "Northwest Territories Nominee Program (NTNP)",
          "capital": "Yellowknife",
          "population": "45,000",
          "description": "Northern territory with resource industry and unique opportunities.",
          "streams": [
            {
              "name": "Employer Driven",
              "type": "Non-Express Entry",
              "description": "For workers with NWT job offers"
            },
            {
              "name": "Express Entry",
              "type": "Express Entry",
              "description": "For Express Entry candidates with NWT job offers"
            }
          ]
        },
        {
          "id": "nunavut",
          "name": "Nunavut",
          "code": "NU",
          "program_name": "No active PNP",
          "capital": "Iqaluit",
          "population": "40,000",
          "description": "Canada's newest and largest territory. Currently does not have an active PNP.",
          "streams": []
        }
      ]
    },
    "study_permit": {
      "id": "study-permit",
      "title": "Study in Canada",
      "description": "Complete guides to studying in Canada, from application to post-graduation work permits and pathways to permanent residence.",
      "icon": "bi-mortarboard",
      "color": "#10B981",
      "guides": [
        {
          "id": "overview",
          "title": "Study Permit Application Guide",
          "subtitle": "Step-by-step guide to applying for your Canadian study permit",
          "icon": "🎓",
          "difficulty": "Beginner",
          "reading_time": "15 min read",
          "overview": "A study permit allows you to study at a designated learning institution (DLI) in Canada. This comprehensive guide covers eligibility, required documents, application process, and tips for approval.",
          "sections": [
            {
              "title": "Study Permit Basics",
              "content": "A study permit is a document that allows foreign nationals to study at a Designated Learning Institution (DLI) in Canada. It is NOT a visa - you may also need a visitor visa or eTA to enter Canada. Study permits are typically valid for the length of your program plus 90 days. You can work up to 20 hours/week during academic sessions and full-time during scheduled breaks."
            },
            {
              "title": "Eligibility Requirements",
              "content": "To qualify for a study permit you must: 1) Have an acceptance letter from a DLI, 2) Prove you have enough money to pay tuition, living expenses, and return transportation (approximately CAD $20,635/year for living expenses outside Quebec), 3) Be a law-abiding citizen with no criminal record, 4) Be in good health (may require medical exam), 5) Convince an officer you will leave Canada when your permit expires."
            },
            {
              "title": "Required Documents",
              "content": "Standard documents include: Valid passport, Acceptance letter from a DLI, Proof of financial support (bank statements, GIC, scholarship letters, sponsor letters), Letter of explanation stating your purpose and ties to home country, Provincial Attestation Letter (PAL) for most provinces since 2024, Passport-size photos meeting IRCC specifications, Language test results (if required), and Police clearance certificates."
            },
            {
              "title": "Provincial Attestation Letter (PAL)",
              "content": "Since January 2024, most study permit applications require a Provincial Attestation Letter (PAL). This letter confirms your province/territory has allocated a spot for you within their international student cap. Each province has its own PAL issuance process - typically provided by your DLI after you accept your offer. Exemptions include master's, doctoral, and some K-12 programs."
            },
            {
              "title": "Application Process",
              "content": "1) Get accepted to a DLI and obtain PAL, 2) Gather all required documents, 3) Create an IRCC account online, 4) Complete the application forms (IMM 1294), 5) Pay the fees ($150 CAD processing + $85 biometrics), 6) Submit biometrics at a VAC or ASC within 30 days, 7) Wait for processing (varies by country, typically 4-12 weeks), 8) If approved, travel to Canada and obtain your permit at the port of entry."
            },
            {
              "title": "Tips for Approval",
              "content": "Show strong ties to your home country (property, job, family). Explain why you chose Canada and this specific program. Demonstrate sufficient funds that are readily accessible. Choose a program aligned with your past education/career. Avoid previously refused applications or overstays. Submit complete documentation the first time. Consider applying from countries with higher approval rates if you have legal status there."
            }
          ]
        },
        {
          "id": "dli-selection",
          "title": "Choosing the Right DLI",
          "subtitle": "How to select a Designated Learning Institution",
          "icon": "🏫",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "Not all Canadian schools qualify you for a study permit or post-graduation work permit. Learn how to verify DLI status and choose programs that support your immigration goals."
        },
        {
          "id": "pgwp",
          "title": "Post-Graduation Work Permit (PGWP)",
          "subtitle": "Work in Canada after your studies",
          "icon": "💼",
          "difficulty": "Intermediate",
          "reading_time": "12 min read",
          "overview": "The PGWP allows you to work in Canada for up to 3 years after graduation. Learn about eligibility requirements, application timing, and how it leads to permanent residence.",
          "sections": [
            {
              "title": "PGWP Basics",
              "content": "The Post-Graduation Work Permit (PGWP) is an open work permit allowing international graduates from eligible Canadian Designated Learning Institutions (DLIs) to work for any employer in Canada. It's a crucial stepping stone to permanent residence through Canadian Experience Class (CEC) or Provincial Nominee Programs."
            },
            {
              "title": "Eligibility Requirements",
              "content": "To qualify you must: Graduate from a PGWP-eligible DLI, Complete a program of at least 8 months, Have maintained full-time student status during your program, Apply within 180 days of receiving your final marks/completion letter. Programs must be degree, diploma, or certificate programs (not ESL, distance learning, or non-DLI programs)."
            },
            {
              "title": "PGWP Duration",
              "content": "PGWP validity depends on your program length: 8-month to 2-year programs = PGWP equal to program length. Programs 2+ years = 3-year PGWP. Multiple programs can be combined if completed back-to-back at same DLI. Example: 1-year diploma = 1-year PGWP. 2-year diploma = 3-year PGWP. 4-year degree = 3-year PGWP (max)."
            },
            {
              "title": "Application Process",
              "content": "1) Receive your final transcript and completion letter, 2) Apply online within 180 days of completing your program, 3) Pay the $255 fee ($155 work permit + $100 open work permit holder fee), 4) Maintain valid status while application is processing (implied status allows you to work). Processing time: typically 80-120 days. You can work full-time while waiting."
            },
            {
              "title": "PGWP to PR Pathway",
              "content": "Use your PGWP wisely: Work in a NOC TEER 0, 1, 2, or 3 occupation to qualify for CEC. Accumulate 1 year of skilled Canadian work experience for Express Entry. Achieve CLB 7+ language scores while working. Consider PNP programs that target international graduates. Many provinces have dedicated streams for PGWP holders with job offers."
            },
            {
              "title": "Important Restrictions",
              "content": "PGWP cannot be extended or renewed. If your PGWP expires before getting PR, consider: Bridging Open Work Permit (if you have AOR for PR), Employer-specific work permit (requires LMIA), Study permit (enroll in another program). Plan your PR application timeline carefully to avoid gaps."
            }
          ]
        },
        {
          "id": "student-to-pr",
          "title": "Student to PR Pathway",
          "subtitle": "Your complete roadmap from student to permanent resident",
          "icon": "🛤️",
          "difficulty": "Intermediate",
          "reading_time": "15 min read",
          "overview": "The student pathway is one of the most popular routes to Canadian PR. Learn how to maximize your chances by choosing the right program, province, and gaining Canadian experience."
        },
        {
          "id": "sds",
          "title": "Student Direct Stream (SDS)",
          "subtitle": "Faster study permit processing for eligible countries",
          "icon": "⚡",
          "difficulty": "Beginner",
          "reading_time": "8 min read",
          "overview": "The Student Direct Stream offers faster processing (typically 20 days) for applicants from eligible countries who meet specific requirements. Learn if you qualify and how to apply."
        }
      ]
    },
    "work_permit": {
      "id": "work-permit",
      "title": "Work Permits",
      "description": "Understand the different types of Canadian work permits, from LMIA-based permits to open work permits and LMIA-exempt categories.",
      "icon": "bi-briefcase",
      "color": "#F59E0B",
      "guides": [
        {
          "id": "overview",
          "title": "Work Permit Overview",
          "subtitle": "Understanding Canadian work permit categories",
          "icon": "📋",
          "difficulty": "Beginner",
          "reading_time": "12 min read",
          "overview": "Canadian work permits come in many forms: LMIA-based, LMIA-exempt, open, and employer-specific. This guide helps you understand which type applies to your situation.",
          "sections": [
            {
              "title": "Types of Work Permits",
              "content": "There are two main categories: Employer-Specific Work Permits (tied to one employer, job, and location) and Open Work Permits (work for any employer anywhere in Canada). Employer-specific permits may require an LMIA or qualify for LMIA exemption. Open work permits are available through specific programs like PGWP, spousal permits, or bridging permits."
            },
            {
              "title": "LMIA-Based Work Permits",
              "content": "Labour Market Impact Assessment (LMIA) work permits require your employer to first obtain an LMIA from Employment and Social Development Canada (ESDC). This proves hiring a foreign worker won't negatively impact Canadian workers. The LMIA process takes 2-3 months and costs $1,000 per position. A positive LMIA adds 50-200 points to your CRS score for Express Entry."
            },
            {
              "title": "LMIA-Exempt Work Permits",
              "content": "Many work permits don't require an LMIA under international agreements or specific programs: CUSMA/NAFTA professionals, Intra-Company Transfers (ICT), International Experience Canada (IEC), Post-Graduation Work Permit (PGWP), Spousal Open Work Permits, Significant benefit to Canada (researchers, academics). These use LMIA exemption codes (e.g., R205, R204)."
            },
            {
              "title": "Open Work Permits",
              "content": "Open work permits let you work for any employer. Categories include: Post-Graduation Work Permit (PGWP) for DLI graduates, Spousal/Common-law Partner OWP for spouses of skilled workers or students, Bridging OWP while waiting for PR, Vulnerable Worker OWP, and specific humanitarian programs. Most valuable for gaining Canadian experience for Express Entry."
            },
            {
              "title": "Application Process",
              "content": "1) Determine your eligibility category, 2) Gather employer documents (job offer, LMIA if needed, or exemption code), 3) Gather personal documents (passport, photo, proof of status), 4) Apply online via IRCC portal, 5) Pay fees ($155 work permit + $85 biometrics), 6) Submit biometrics within 30 days, 7) Wait for processing (varies 2-16 weeks by country), 8) Receive work permit at port of entry or by mail if inside Canada."
            },
            {
              "title": "Work Permit Duration",
              "content": "Employer-specific permits are usually valid for the job offer duration (max 2-3 years). PGWP validity matches your program length (8 months to 3 years). IEC permits are typically 12-24 months depending on country. Spousal OWPs match the principal applicant's permit. All permits can potentially be renewed or extended if you remain eligible."
            }
          ]
        },
        {
          "id": "lmia",
          "title": "LMIA Work Permits",
          "subtitle": "Employer-sponsored work permits with Labour Market Impact Assessment",
          "icon": "📄",
          "difficulty": "Intermediate",
          "reading_time": "15 min read",
          "overview": "An LMIA is a document that a Canadian employer may need to obtain before hiring a foreign worker. Learn about the LMIA process, exemptions, and how it affects your work permit."
        },
        {
          "id": "open-work-permit",
          "title": "Open Work Permits",
          "subtitle": "Work for any employer in Canada",
          "icon": "🔓",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "Open work permits allow you to work for any Canadian employer without needing a specific job offer. Learn about eligibility categories including spouse permits, bridging permits, and PGWP."
        },
        {
          "id": "iec",
          "title": "International Experience Canada (IEC)",
          "subtitle": "Working Holiday, Young Professionals, and Co-op programs",
          "icon": "🌎",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "IEC allows young people from partner countries to work and travel in Canada. Learn about the three categories, eligibility requirements, and how to apply.",
          "sections": [
            {
              "title": "IEC Categories",
              "content": "There are 3 IEC categories: 1) Working Holiday - open work permit, no job offer needed, work for any employer. 2) Young Professionals - employer-specific permit, need job offer in your field of study. 3) International Co-op - for students doing internship as part of studies, need job offer. Availability varies by country agreement."
            },
            {
              "title": "Eligibility Requirements",
              "content": "General requirements: Citizen of a participating country, typically 18-30 or 18-35 (varies by country), have a valid passport, have health insurance, have enough money for initial expenses (~$2,500 CAD), no criminal record, never participated in same IEC category before. Country-specific requirements may apply."
            },
            {
              "title": "Participating Countries",
              "content": "35+ countries have IEC agreements with Canada including: UK, Ireland, France, Germany, Australia, Japan, South Korea, Hong Kong, Taiwan, and many more. Age limits and quotas vary by country. For example: UK (18-30, ~10,000 spots), France (18-35, ~14,000 spots), Australia (18-30, unlimited). Check IRCC for your country's specific terms."
            },
            {
              "title": "Application Process",
              "content": "1) Create IEC profile during the seasonal round (usually November-April), 2) Enter pool(s) for your eligible categories, 3) If drawn, receive Invitation to Apply (ITA) via lottery, 4) Accept ITA and submit full application within 10 days, 5) Pay fees ($156 participation + $100 OWP holder fee + $85 biometrics), 6) Submit biometrics, 7) Receive Port of Entry letter, 8) Activate work permit within 12 months at Canadian border."
            },
            {
              "title": "IEC to PR Pathway",
              "content": "IEC is excellent for gaining Canadian work experience for Express Entry: Work 1 year in skilled occupation (NOC TEER 0/1/2/3) to qualify for CEC. Use your time in Canada to improve language scores. Network and find an employer for PNP nomination. Some provinces have streams specifically for workers with Canadian experience. Plan your PR strategy from day one."
            },
            {
              "title": "Tips for Getting Selected",
              "content": "Apply early when rounds open (competition increases throughout the season). Check your profile regularly for ITAs (10-day deadline to accept). Some countries have multiple draws - stay in the pool if not selected initially. Have documents ready before applying (police certificate takes time). Consider less popular categories (Young Professionals often has more spots than Working Holiday)."
            }
          ]
        },
        {
          "id": "intra-company-transfer",
          "title": "Intra-Company Transfers (ICT)",
          "subtitle": "For multinational company employees",
          "icon": "🏢",
          "difficulty": "Intermediate",
          "reading_time": "10 min read",
          "overview": "ICT work permits allow employees of multinational companies to transfer to Canadian branches. Learn about the eligibility requirements and application process."
        }
      ]
    },
    "credentials": {
      "id": "credentials",
      "title": "Credential Evaluation",
      "description": "Educational Credential Assessment (ECA) guides for Express Entry and professional licensing in Canada.",
      "icon": "bi-award",
      "color": "#8B5CF6",
      "guides": [
        {
          "id": "wes",
          "title": "WES ECA Guide",
          "subtitle": "Step-by-step World Education Services credential evaluation",
          "icon": "📜",
          "difficulty": "Beginner",
          "reading_time": "15 min read",
          "overview": "WES is the most popular credential evaluation service for Express Entry. This guide covers the application process, document requirements, and expected timelines.",
          "sections": [
            {
              "title": "What is WES ECA?",
              "content": "World Education Services (WES) is a designated organization that evaluates foreign educational credentials against Canadian standards. An ECA report from WES is required for Express Entry to prove your education level. The report compares your degree to a Canadian equivalent (e.g., foreign bachelor's = Canadian bachelor's degree)."
            },
            {
              "title": "Application Process",
              "content": "1) Create a WES account at wes.org/ca, 2) Select 'ECA Application for IRCC', 3) Enter your education details and pay fees, 4) Receive your WES reference number, 5) Request your institution to send documents directly to WES, 6) WES reviews documents and issues report (7-20 business days after receiving all documents)."
            },
            {
              "title": "Required Documents",
              "content": "Documents must be sent directly from your institution to WES: Official transcripts (sealed), Degree certificate/diploma, Credential verification form (for some countries). For India: transcripts via WES-approved agencies. For China: verification through CHESICC/CDGDC. For Philippines: send through WES-approved courier. Check WES country requirements for your specific case."
            },
            {
              "title": "Fees and Timeline",
              "content": "WES fees: CAD $220 (ECA for IRCC) + document handling fees. Processing time: 7-20 business days after WES receives all documents. Total timeline typically 4-8 weeks including document delivery. Express evaluation available for additional fee. ECA report is valid for 5 years from issue date."
            },
            {
              "title": "Country-Specific Requirements",
              "content": "India: Use WES Gateway or authorized agents like DataFlow. China: Academic records through CHESICC, degree through CDGDC. Philippines: Red ribbon apostille required. Pakistan: HEC verification required. Nigeria: Transcripts via school directly. Most countries: sealed transcripts sent directly from institution. Always check WES Required Documents tool for your country."
            },
            {
              "title": "Tips for Success",
              "content": "Start early - the process can take 2+ months. Request extra official transcript copies from your institution. Track your documents using WES online portal. Ensure your name matches across all documents and passport. If you have multiple degrees, you may only need ECA for your highest credential. Contact WES support if documents are delayed."
            }
          ]
        },
        {
          "id": "eca-overview",
          "title": "ECA Overview",
          "subtitle": "Understanding Educational Credential Assessments",
          "icon": "🎓",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "An ECA compares your foreign education to Canadian standards. Learn which organizations are designated by IRCC and how to choose the right one for your situation."
        },
        {
          "id": "professional-licensing",
          "title": "Professional Licensing in Canada",
          "subtitle": "Getting your credentials recognized for regulated professions",
          "icon": "⚕️",
          "difficulty": "Advanced",
          "reading_time": "20 min read",
          "overview": "Many professions in Canada are regulated, requiring additional licensing beyond an ECA. Learn about the process for engineers, nurses, doctors, accountants, and other regulated professions."
        }
      ]
    },
    "forms": {
      "id": "forms",
      "title": "Immigration Forms",
      "description": "Step-by-step guides for filling out IRCC immigration forms correctly. Avoid common mistakes that lead to application refusals.",
      "icon": "bi-file-earmark-text",
      "color": "#EC4899",
      "guides": [
        {
          "id": "imm-0008",
          "title": "IMM 0008 Generic Application Form",
          "subtitle": "The main application form for permanent residence",
          "icon": "📝",
          "difficulty": "Intermediate",
          "reading_time": "20 min read",
          "overview": "IMM 0008 is the generic application form for Canadian permanent residence. This guide covers every section with examples and tips to avoid common mistakes."
        },
        {
          "id": "imm-5669",
          "title": "IMM 5669 Schedule A",
          "subtitle": "Background and personal history declaration",
          "icon": "📋",
          "difficulty": "Intermediate",
          "reading_time": "15 min read",
          "overview": "Schedule A (IMM 5669) is a detailed form about your background, education, employment, and travel history. Learn how to complete it accurately."
        },
        {
          "id": "imm-5406",
          "title": "IMM 5406 Additional Family Information",
          "subtitle": "Family information form for immigration applications",
          "icon": "👨‍👩‍👧",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "IMM 5406 collects information about your family members. Learn who needs to be included and how to complete each section."
        },
        {
          "id": "imm-1294",
          "title": "IMM 1294 Application for Study Permit",
          "subtitle": "Study permit application form guide",
          "icon": "🎓",
          "difficulty": "Intermediate",
          "reading_time": "15 min read",
          "overview": "Complete guide to filling out the study permit application form, including tips for a successful application."
        },
        {
          "id": "imm-1295",
          "title": "IMM 1295 Application for Work Permit",
          "subtitle": "Work permit application form guide",
          "icon": "💼",
          "difficulty": "Intermediate",
          "reading_time": "15 min read",
          "overview": "Step-by-step guide to the work permit application form for both LMIA-based and LMIA-exempt work permits."
        }
      ]
    },
    "language_tests": {
      "id": "language-tests",
      "title": "Language Tests",
      "description": "Comprehensive guides for IELTS, CELPIP, TEF, and TCF language tests required for Canadian immigration.",
      "icon": "bi-chat-dots",
      "color": "#0EA5E9",
      "guides": [
        {
          "id": "ielts",
          "title": "IELTS General Training Guide",
          "subtitle": "Prepare for the IELTS test for Canadian immigration",
          "icon": "📝",
          "difficulty": "Beginner",
          "reading_time": "15 min read",
          "overview": "IELTS General Training is one of the most popular English tests for Canadian immigration. Learn about the test format, scoring, and how it converts to CLB levels.",
          "sections": [
            {
              "title": "IELTS for Immigration",
              "content": "For Canadian immigration, you need IELTS General Training (NOT Academic). Results are valid for 2 years from the test date. The test measures four abilities: Listening (30 min), Reading (60 min), Writing (60 min), and Speaking (11-14 min). You receive band scores from 0-9 for each ability, which convert to Canadian Language Benchmark (CLB) levels."
            },
            {
              "title": "CLB Conversion Chart",
              "content": "IELTS to CLB conversion: Listening - 4.5=CLB4, 5.0=CLB5, 5.5=CLB6, 6.0=CLB7, 7.5=CLB8, 8.0=CLB9, 8.5=CLB10. Reading - 3.5=CLB4, 4.0=CLB5, 5.0=CLB6, 6.0=CLB7, 6.5=CLB8, 7.0=CLB9, 8.0=CLB10. Writing - 4.0=CLB4, 5.0=CLB5, 5.5=CLB6, 6.0=CLB7, 6.5=CLB8, 7.0=CLB9, 7.5=CLB10. Speaking - 4.0=CLB4, 5.0=CLB5, 5.5=CLB6, 6.0=CLB7, 6.5=CLB8, 7.0=CLB9, 7.5=CLB10."
            },
            {
              "title": "Test Format",
              "content": "Listening: 4 sections, 40 questions, recordings of native speakers. Reading: 3 sections, 40 questions, texts from books, magazines, newspapers. Writing: Task 1 (150 words minimum) - write a letter; Task 2 (250 words minimum) - essay responding to a point of view. Speaking: Face-to-face interview in 3 parts (introduction, long turn, discussion)."
            },
            {
              "title": "Target Scores for Immigration",
              "content": "Express Entry minimum: CLB 7 for FSW (IELTS 6.0 in each). CEC and PNP often require CLB 5-7 depending on NOC level. For maximum CRS points, aim for CLB 9+ (IELTS 7.0+ Reading, 8.0+ Listening, 7.0+ Writing/Speaking). Each CLB level above 7 significantly increases your score. CLB 9 in all abilities = 124 points vs 68 points at CLB 7."
            },
            {
              "title": "Test Booking and Cost",
              "content": "IELTS costs approximately CAD $310-350 depending on location. Book online through British Council, IDP, or local test centers. Book 2-4 weeks in advance as popular dates fill quickly. Results available online after 13 days (paper-based) or 5-7 days (computer-delivered). You can send results directly to IRCC electronically."
            },
            {
              "title": "Preparation Tips",
              "content": "Practice with official Cambridge IELTS books. Take timed practice tests to build stamina. For Listening: practice note-taking and predicting answers. For Reading: skim and scan techniques, time management (20 min per section). For Writing: learn essay structures, use formal language, address all parts of the task. For Speaking: practice fluency over perfection, expand your answers, use idioms naturally."
            }
          ]
        },
        {
          "id": "celpip",
          "title": "CELPIP General Guide",
          "subtitle": "Canadian English Language Proficiency Index Program",
          "icon": "🍁",
          "difficulty": "Beginner",
          "reading_time": "12 min read",
          "overview": "CELPIP is a Canadian English test taken entirely on computer. Learn about the test format, advantages, and preparation strategies.",
          "sections": [
            {
              "title": "Why Choose CELPIP?",
              "content": "CELPIP (Canadian English Language Proficiency Index Program) is developed by Paragon Testing and is 100% Canadian. Advantages: Entirely computer-based (including speaking), uses Canadian accents and contexts, faster results (8 calendar days online), one sitting (~3 hours), accepted for both Express Entry and citizenship. Results valid for 2 years."
            },
            {
              "title": "Test Format",
              "content": "CELPIP-General has 4 components: Listening (47-55 min) - 6 parts, 38 questions. Reading (55-60 min) - 4 parts. Writing (53-60 min) - 2 tasks (email and responding to survey/opinion). Speaking (15-20 min) - 8 tasks recorded on computer. Total test time: approximately 3 hours in one sitting."
            },
            {
              "title": "Scoring and CLB Conversion",
              "content": "CELPIP scores range from M (minimal) to 12. Direct CLB conversion: CELPIP 4=CLB4, CELPIP 5=CLB5, CELPIP 6=CLB6, CELPIP 7=CLB7, CELPIP 8=CLB8, CELPIP 9=CLB9, CELPIP 10+=CLB10. Unlike IELTS, CELPIP scores map directly to CLB levels (e.g., CELPIP 9 = CLB 9, not requiring band interpretation)."
            },
            {
              "title": "Test Locations and Cost",
              "content": "CELPIP is available at test centers across Canada and in some international locations (UAE, Philippines, India, China). Test fee: CAD $280-320 depending on location. Book through celpip.ca. Test dates available weekly in major Canadian cities. Results available online in 8 calendar days and can be sent directly to IRCC."
            },
            {
              "title": "CELPIP vs IELTS",
              "content": "Choose CELPIP if: You prefer computer-based testing, want faster results, are comfortable with Canadian accents, prefer speaking to a computer vs examiner. Choose IELTS if: You prefer paper-based tests, want face-to-face speaking, need results accepted in other countries. Both are equally accepted by IRCC."
            },
            {
              "title": "Preparation Strategies",
              "content": "Use official CELPIP practice tests at celpip.ca. Practice typing for writing section (you type responses). Get comfortable speaking into a microphone (no human interaction). Practice with timer - strict time limits per task. Focus on Canadian spelling and expressions. Free preparation resources available on CELPIP website including sample questions and webinars."
            }
          ]
        },
        {
          "id": "pte-core",
          "title": "PTE Core Guide",
          "subtitle": "Pearson Test of English for Canadian immigration",
          "icon": "💻",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "PTE Core is the newest IRCC-approved English test. Learn about its unique computer-based format and rapid results delivery."
        },
        {
          "id": "french-tests",
          "title": "French Language Tests (TEF/TCF)",
          "subtitle": "French proficiency tests for Canadian immigration",
          "icon": "🇫🇷",
          "difficulty": "Intermediate",
          "reading_time": "12 min read",
          "overview": "French proficiency can significantly boost your CRS score. Learn about TEF Canada and TCF Canada tests, scoring, and the benefits of French proficiency."
        },
        {
          "id": "clb-conversion",
          "title": "CLB Score Conversion Guide",
          "subtitle": "Convert your test scores to Canadian Language Benchmark levels",
          "icon": "🔄",
          "difficulty": "Beginner",
          "reading_time": "8 min read",
          "overview": "Canadian immigration uses CLB (Canadian Language Benchmarks) levels. Learn how to convert your IELTS, CELPIP, PTE, or French test scores to CLB/NCLC levels."
        }
      ]
    },
    "family": {
      "id": "family",
      "title": "Family Sponsorship",
      "description": "Guides for sponsoring family members to Canada, including spouses, parents, grandparents, and dependent children.",
      "icon": "bi-people",
      "color": "#F43F5E",
      "guides": [
        {
          "id": "spouse",
          "title": "Spousal Sponsorship Guide",
          "subtitle": "Sponsor your spouse or common-law partner for PR",
          "icon": "💑",
          "difficulty": "Intermediate",
          "reading_time": "20 min read",
          "overview": "Spousal sponsorship allows Canadian citizens and permanent residents to sponsor their spouse, common-law partner, or conjugal partner for permanent residence. Learn about inland vs outland applications.",
          "sections": [
            {
              "title": "Who Can Sponsor",
              "content": "You can sponsor if you are: A Canadian citizen or permanent resident, at least 18 years old, and can prove you can support your spouse financially. You cannot sponsor if: you are on social assistance (except disability), you have an unremoved deportation order, you are in prison, you were sponsored as a spouse yourself and became PR less than 5 years ago, or you are in default on family support obligations."
            },
            {
              "title": "Who Can Be Sponsored",
              "content": "You can sponsor your: Spouse (legally married), Common-law partner (lived together in conjugal relationship for at least 12 continuous months), or Conjugal partner (in committed relationship for 1+ year but could not live together or marry due to immigration barriers or persecution). Your partner must be 18 or older. Same-sex relationships are recognized."
            },
            {
              "title": "Inland vs Outland Applications",
              "content": "Inland: Sponsored person is already in Canada with valid status. Can apply for Open Work Permit while waiting (usually granted in ~4 months). Cannot leave Canada while processing without abandoning application. Processing time: ~12-15 months. Outland: Sponsored person is outside Canada. They continue living abroad during processing. Can visit Canada on visitor visa. Processing time: ~12-24 months depending on country."
            },
            {
              "title": "Required Documents",
              "content": "Key documents include: Proof of sponsor's status (citizenship or PR card), Marriage certificate or proof of common-law relationship, Relationship history and photos together, Joint financial documents (lease, bank accounts, bills), Communication history (messages, call logs), Forms: IMM 1344, IMM 0008, IMM 5669, IMM 5406, IMM 5532. Police certificates from all countries lived in 6+ months since age 18."
            },
            {
              "title": "Processing Times and Fees",
              "content": "Current processing time: 12-15 months (inland), 12-24 months (outland). Fees: $1,080 sponsorship fee + $500 PR processing fee + $85 biometrics + $500 RPRF (Right of Permanent Residence Fee) = ~$2,165 total. Additional fees may apply for translations, police certificates, and medical exams."
            },
            {
              "title": "Proving Genuine Relationship",
              "content": "IRCC looks for evidence your relationship is genuine: Photos together over time (dates, occasions), Joint financial commitments (lease, bills, accounts), Travel together, Communication records, Wedding photos/video, Affidavits from friends/family. Red flags include: large age gaps, no common language, brief courtship, financial incentives, inconsistent interview answers."
            }
          ]
        },
        {
          "id": "pgp",
          "title": "Parents and Grandparents Program (PGP)",
          "subtitle": "Sponsor your parents or grandparents for PR",
          "icon": "👴👵",
          "difficulty": "Intermediate",
          "reading_time": "15 min read",
          "overview": "The PGP allows Canadian citizens and permanent residents to sponsor their parents and grandparents. Learn about the lottery system, income requirements, and Super Visa alternatives.",
          "sections": [
            {
              "title": "How PGP Works",
              "content": "The Parents and Grandparents Program uses an interest-to-sponsor intake system. Each year, IRCC invites potential sponsors to submit interest forms during a limited window (usually October). Invitations to apply are sent randomly to selected sponsors. Limited spots available (~15,000-25,000 per year), making this highly competitive."
            },
            {
              "title": "Sponsor Eligibility",
              "content": "To sponsor parents/grandparents you must: Be a Canadian citizen or permanent resident, Be at least 18 years old, Live in Canada, Meet minimum income requirements for 3 consecutive tax years, Sign an undertaking to support your parents for 20 years. You cannot sponsor if you received social assistance (except disability) or defaulted on previous sponsorship."
            },
            {
              "title": "Minimum Income Requirements",
              "content": "You must meet LICO+ (Low Income Cut-Off + 30%) for 3 consecutive years. 2024 requirements (example): 2 people household = $43,082, 3 people = $52,965, 4 people = $64,306, 5 people = $72,927. Income can include employment, self-employment, and EI. Does NOT include social assistance or provincial child benefits. Spouse's income can be combined if they co-sign."
            },
            {
              "title": "Application Process",
              "content": "1) Submit interest-to-sponsor form during intake period, 2) If selected, receive Invitation to Apply (ITA), 3) Submit complete application within 60 days of ITA, 4) Provide income proof (NOAs for 3 years), 5) Parents complete medical exams and police certificates, 6) Processing takes 20-36 months. Your parents cannot work or access healthcare until PR is granted."
            },
            {
              "title": "Super Visa Alternative",
              "content": "If not selected for PGP, consider Super Visa: Valid for up to 10 years, allows stays of up to 5 years per visit, parents can visit without PR status. Requirements: Valid medical insurance, sponsor's proof of income (1 year only), letter of invitation. Super Visa holders cannot work in Canada but can visit for extended periods."
            },
            {
              "title": "Tips for Success",
              "content": "Submit interest form immediately when intake opens (first-come basis in some years). Keep 3 years of tax returns and NOAs ready. Consider increasing income before applying if below threshold. Have backup plan (Super Visa) while waiting. Processing is lengthy - start when parents are still healthy enough for medical exam. Maintain communication with IRCC through your account."
            }
          ]
        },
        {
          "id": "super-visa",
          "title": "Super Visa for Parents/Grandparents",
          "subtitle": "Long-term visitor visa for parents and grandparents",
          "icon": "✈️",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "The Super Visa allows parents and grandparents to visit Canada for up to 5 years at a time. Learn about requirements and how it differs from regular visitor visas."
        },
        {
          "id": "dependent-children",
          "title": "Sponsoring Dependent Children",
          "subtitle": "Including children in your immigration application",
          "icon": "👶",
          "difficulty": "Beginner",
          "reading_time": "10 min read",
          "overview": "Learn how to include dependent children in your immigration application, age limits, and requirements for adopted children."
        }
      ]
    },
    "refugees": {
      "id": "refugees",
      "title": "Refugees & Protected Persons",
      "description": "Information about Canada's refugee protection system and pathways for protected persons.",
      "icon": "bi-shield-check",
      "color": "#14B8A6",
      "guides": [
        {
          "id": "refugee-claim",
          "title": "Making a Refugee Claim",
          "subtitle": "Understanding Canada's refugee protection process",
          "icon": "🛡️",
          "difficulty": "Intermediate",
          "reading_time": "15 min read",
          "overview": "Canada provides protection to people who fear persecution in their home country. Learn about the refugee claim process, eligibility, and what to expect."
        },
        {
          "id": "protected-person-pr",
          "title": "Protected Person to PR",
          "subtitle": "Pathway to permanent residence for protected persons",
          "icon": "📄",
          "difficulty": "Intermediate",
          "reading_time": "12 min read",
          "overview": "Once you're recognized as a protected person in Canada, you can apply for permanent residence. Learn about the application process and requirements."
        }
      ]
    }
  },
  "updated": "2026-01-13T00:00:00.000000"
}
